
export class TempResponseDto {
    temp: any =   [
        {
            "activity": "water_intake",
            "type": "total",
            "value": "1800.00",
            "description": "어제 1800ml의 수분 섭취로 신진대사를 원활하게 하셨습니다. 수분 균형이 잘 맞으면 밤중에 깨는 일이 줄어들고 깊은 잠을 촉진 할 수 있어요. 계속해서 이 습관을 유지해보세요, 이는 수면의 연속성을 강화하는 데 큰 도움이 될 거예요."
        },
        {
            "activity": "step_count",
            "type": "min",
            "value": "10000.00",
            "description": "걸음 수가 7000보였네요. 10000보를 목표로 조금 더 걸어보세요. 꾸준한 걷기는 신체 에너지 소비를 촉진하며 스트레스 수준을 낮추고 수면 효율을 높일 수 있습니다. 연구에 따르면 신체활동이 활발할수록 수면의 질이 개선된다고 하네요."
        },
        {
            "activity": "caffeine",
            "type": "max",
            "value": "100.00",
            "description": "어제 카페인을 100mg 섭취하셨군요. 카페인이 수면을 방해할 수 있는 만큼, 이 섭취량을 유지하셔서 숙면을 돕는 것이 좋겠습니다. 카페인은 아데노신 수용체의 작용을 방해해 각성 효과를 내므로, 이른 시간에만 적정량을 드시는 것이 유리합니다."
        }
    ]
}